Repository: 84000/data-translation-memory
Catalog: toh44-38-v4.tmx
Source language: bo
Languages: en

source: དེ་ནས་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་ཀྱི་རྒྱལ་པོས་ཡང་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ལ་སྨྲས་པ། ཀྱེ་རྒྱལ་བའི་སྲས་དག །
en: Chapter on the Dwellings of Bodhisattvas Then the bodhisattva King of Mind spoke again to those bodhisattvas, “O children of the Victorious One!

source: ཤར་ཕྱོགས་ལོགས་ན་སྔན་ཅད་བྱང་ཆུབ་སེམས་དཔའ་བཞུགས་བཞུགས་པའི་རི་དྲང་སྲོང་འབྱུང་བ་ཞེས་བྱ་བ་ཡོད་དེ།
en: In the east, there is a mountain called Appearance of a Sage, where bodhisattvas in the past have resided.

source: །དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་རྡོ་རྗེ་དཔལ་ཞེས་བྱ་བ། བྱང་ཆུབ་སེམས་དཔའི་འཁོར་སུམ་བརྒྱ་དང་ལྡན་པ་ཆོས་སྟོན་ཏོ།
en: In this dwelling place a bodhisattva called Vajraśrī teaches Dharma surrounded by a retinue of three hundred bodhisattvas. “

source: །ཀྱེ་རྒྱལ་བའི་སྲས་དག་ལྷོ་ཕྱོགས་ལོགས་ན་སྔོན་བྱང་ཆུབ་སེམས་དཔའ་བཞུགས་བཞུགས་པའི་རི་དཔལ་གྱི་ཕུང་པོ་ཞེས་བྱ་བ་ཡོད་དེ།
en: O children of the Victorious One! In the south, there is a mountain called Heap of Glory, where bodhisattvas in the past have resided.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཀྱི་བློ་གྲོས་ཞེས་བྱ་བ་བྱང་ཆུབ་སེམས་དཔའི་འཁོར་ལྔ་བརྒྱ་དང་ལྡན་པ་ཆོས་སྟོན་ཏོ།
en: In this dwelling place a bodhisattva called Dharmamati teaches Dharma surrounded by a retinue of five hundred bodhisattvas. “

source: །ཀྱེ་རྒྱལ་བའི་སྲས་དག་ནུབ་ཕྱོགས་ལོགས་ན་སྔོན་བྱང་ཆུབ་སེམས་དཔའ་བཞུགས་བཞུགས་པའི་རི་རྡོ་རྗེའི་འོད་འཕྲོ་བ་ཅན་ཞེས་བྱ་བ་ཡོད་དེ།
en: O children of the Victorious One! In the west, there is a mountain called Possessed of Vajra Radiance, where bodhisattvas in the past have resided.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེང་གེའི་འགྲོས་སུ་འགྲོ་བ་ཞེས་བྱ་བ། བྱང་ཆུབ་སེམས་དཔའི་འཁོར་སུམ་བརྒྱ་དང་ལྡན་པ་ཆོས་སྟོན་ཏོ།
en: In this dwelling place a bodhisattva called Walks with the Gait of a Lion teaches Dharma surrounded by a retinue of three hundred bodhisattvas. “

source: །ཀྱེ་རྒྱལ་བའི་སྲས་དག་བྱང་ཕྱོགས་ལོགས་ན། སྔོན་བྱང་ཆུབ་སེམས་དཔའ་བཞུགས་བཞུགས་པའི་རི་སྤོས་ཀྱི་ཕུང་པོ་ཞེས་བྱ་བ་ཡོད་དེ།
en: O children of the Victorious One! In the north, there is a mountain called Heap of Incense, where bodhisattvas in the past have resided.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སྤོས་ཀྱི་གླང་པོ་ཞེས་བྱ་བ། བྱང་ཆུབ་སེམས་དཔའི་འཁོར་སྟོང་ཕྲག་གསུམ་དང་ལྡན་པ་ཆོས་སྟོན་ཏོ།
en: In this dwelling place a bodhisattva called Gandhahastin teaches Dharma surrounded by a retinue of three thousand bodhisattvas. “

source: །ཀྱེ་རྒྱལ་བའི་སྲས་དག །
en: O children of the Victorious One!

source: ཤར་ཕྱོགས་ལོགས་ན་སྔོན་བྱང་ཆུབ་སེམས་དཔའ་བཞུགས་བཞུགས་པའི་རི་སྤང་རི་ཞེས་བྱ་བ་ཡོད་དེ།
en: In the east, there is a mountain called Mountain of Meadows, where bodhisattvas in the past have resided.

source: །དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་འཇམ་དཔལ་ཞེས་བྱ་བ། བྱང་ཆུབ་སེམས་དཔའི་འཁོར་སྟོང་ཕྲག་བཅུ་དང་ལྡན་པ་ཆོས་སྟོན་ཏོ།
en: In this dwelling place a bodhisattva called Mañjuśrī teaches Dharma surrounded by a retinue of ten thousand bodhisattvas. “

source: བྱང་དང་ཤར་གྱི་ཕྱོགས་མཚམས་ལོགས་ན། སྔོན་བྱང་ཆུབ་སེམས་དཔའ་བཞུགས་བཞུགས་པའི་རི་རྒྱ་མཚོ་ཆེན་པོ་བཞིའི་གནས་རྡོ་རྗེའི་རི་ཞེས་བྱ་བ་ཡོད་དེ།
en: In the northeastern direction, there is a mountain called Vajra Mountain, Site of Four Great Oceans, where bodhisattvas in the past have resided.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཀྱིས་འཕགས་པ་ཞེས་བྱ་བ། བྱང་ཆུབ་སེམས་དཔའི་འཁོར་བརྒྱ་ཕྲག་བཅུ་གཉིས་དང་ལྡན་པ་ཆོས་སྟོན་ཏོ།
en: In this dwelling place a bodhisattva called Dharmodgata teaches Dharma surrounded by a retinue of twelve hundred bodhisattvas. “

source: ཤར་དང་ལྷོའི་ཕྱོགས་མཚམས་ལོགས་ན་སྔོན་བྱང་ཆུབ་སེམས་དཔའ་བཞུགས་བཞུགས་པའི་རི་མཆོད་རྟེན་ཞེས་བྱ་བ་ཡོད་དེ།
en: In the southeastern direction, there is a mountain called Stūpa, where bodhisattvas in the past have resided.

source: །དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་ལྷའི་ཕུང་པོ་ཞེས་བྱ་བ་བྱང་ཆུབ་སེམས་དཔའི་འཁོར་སྟོང་དང་ལྡན་པ་ཆོས་སྟོན་ཏོ།
en: In this dwelling place a bodhisattva called Divine Aggregates teaches Dharma surrounded by a retinue of one thousand bodhisattvas. “

source: །ཀྱེ་རྒྱལ་བའི་སྲས་ངག །
en: O children of the Victorious One!

source: ལྷོ་དང་ནུབ་ཀྱི་ཕྱོགས་མཚམས་ལོགས་ན། སྔོན་བྱང་ཆུབ་སེམས་དཔའ་བཞུགས་བཞུགས་པའི་རི་སྐར་མའི་འོད་ཅེས་བྱ་བ་ཡོད་དེ།
en: In the southwestern direction, there is a mountain called Jyotiṣprabha, where bodhisattvas in the past have resided.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་བཟང་པོའི་དཔལ་ཞེས་བྱ་བ། བྱང་ཆུབ་སེམས་དཔའི་འཁོར་སྟོང་ཕྲག་གསུམ་དང་ལྡན་པ་ཆོས་སྟོན་ཏོ།
en: In this dwelling place a bodhisattva called Bhadraśrī teaches Dharma surrounded by a retinue of three thousand bodhisattvas. “

source: ནུབ་དང་བྱང་གི་ཕྱོགས་མཚམས་ལོགས་ན། སྔོན་བྱང་ཆུབ་སེམས་དཔའ་བཞུགས་བཞུགས་པའི་རི་སྤོས་ཀྱི་ངད་ཅན་ཞེས་བྱ་བ་ཡོད་དེ།
en: In the northwestern direction, there is a mountain called Gandhamādana, where bodhisattvas in the past have resided.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སྤོས་ཀྱི་འོད་ཟེར་རབ་ཏུ་འགྱེད་པ་ཞེས་བྱ་བ་བྱང་ཆུབ་སེམས་དཔའི་འཁོར་སྟོང་ཕྲག་ལྔ་དང་ལྡན་པ་ཆོས་སྟོན་ཏོ།
en: In this dwelling place a bodhisattva called Radiating Luminous Incense teaches Dharma surrounded by a retinue of five thousand bodhisattvas. “

source: རྒྱ་མཚོ་ཆེན་པོའི་ནང་ན་སྔོན་བྱང་ཆུབ་སེམས་དཔའ་བཞུགས་བཞུགས་པའི་གནས་ཕུག་བཟང་པོ་ཞེས་བྱ་བ་ཡོད་དོ།
en: In the great ocean, there is a place called Good Cave, where bodhisattvas in the past have resided. “

source: ཡུལ་ཤིན་ཏུ་ཡངས་པའི་ལྷོ་ཕྱོགས་ལོགས་ན། སྔོན་བྱང་ཆུབ་སེམས་དཔའ་བཞུགས་བཞུགས་པའི་གནས་རྩ་བ་ཤིན་ཏུ་བརྟན་པ་ཞེས་བྱ་བ་ཡོད་དོ།
en: To the south of Vaiśālī, there is a place called Stable Roots, where bodhisattvas in the past have resided. “

source: །ཡུལ་པ་ཏ་ལའི་བུ་ཞེས་བྱ་བ་ན། སྔོན་བྱང་ཆུབ་སེམས་དཔའ་བཞུགས་བཞུགས་པའི་དགེ་འདུན་གྱི་ཀུན་དགའ་ར་བ་གསེར་གྱི་གླིང་ཞེས་བྱ་བ་ཡོད་དོ།
en: In a land called Pāṭaliputra, there is a place called Golden Park of the Saṅgha, where bodhisattvas in the past have resided. “

source: །ཡུལ་མ་དུར་ན་སྔོན་བྱང་ཆུབ་སེམས་དཔའ་བཞུགས་བཞུགས་པའི་གནས་ཚིམ་པར་བྱེད་པའི་ཕུག་ཅེས་བྱ་བ་ཡོད་དོ།
en: In a land called Mathurā, there is a place called Satisfying Cave, where bodhisattvas in the past have resided. “

source: །ཡུལ་རིལ་བ་གཏོང་བ་ཞེས་བྱ་བ་ན། སྔོན་བྱང་ཆུབ་སེམས་དཔའ་བཞུགས་བཞུགས་པའི་གནས་ཆོས་ཀྱི་སྟན་ཞེས་བྱ་བ་ཡོད་དོ།
en: In a land called Relinquishing the Vase, there is a place called Dharma Seat, where bodhisattvas in the past have resided. “

source: །ཡུལ་དགེ་བའི་ཕུལ་དུ་ཕྱིན་པ་ཞེས་བྱ་བ་ན། སྔོན་བྱང་ཆུབ་སེམས་དཔའ་བཞུགས་བཞུགས་པའི་གནས་བཏང་བཟུང་གི་ཕུག་ཅེས་བྱ་བ་ཡོད་དོ།
en: In a land called Perfect Virtue, there is a place called Mucilinda Cave, where bodhisattvas in the past have resided. “

source: །ཡུལ་བེའུར་ཞེས་བྱ་བ་ན་སྔོན་བྱང་ཆུབ་སེམས་དཔའ་བཞུགས་བཞུགས་པའི་གནས་ཐུ་བ་ཞེས་བྱ་བ་ཀླུས་བཙུགས་པ་ཡོད་དོ།
en: In a land called Vatsa, there is a place, established by nāgas, called Añcala, where bodhisattvas in the past have resided. “

source: །ཡུལ་ཀམ་པོ་ཙ་ན་སྔོན་བྱང་ཆུབ་སེམས་དཔའ་བཞུགས་བཞུགས་པའི་གནས། བྱམས་པས་འཕགས་པ་ཞེས་བྱ་བ་ཡོད་དོ།
en: In a land called Kamboja, there is a place called Exalted by Love, where bodhisattvas in the past have resided. “

source: །རྒྱ་བའི་གནས་ན། སྔོན་བྱང་ཆུབ་སེམས་དཔའ་བཞུགས་བཞུགས་པའི། གནས་མཐུ་བོ་ཆེའི་ཕུག་པ་ཅེས་བྱ་བ་ཡོད་དོ།
en: In a land called China, there is a place called Nārāyaṇa Cave, where bodhisattvas in the past have resided. “

source: །ཡུལ་ཁ་ཤ་ན་སྔོན་བྱང་ཆུབ་སེམས་དཔའ་བཞུགས་བཞུགས་པའི་གནས། བ་ལང་གི་མགོ་བོ་ཞེས་བྱ་བ་ཡོད་དོ།
en: In a land called Khaśa, there is a mountain called Gośṛṇga, where bodhisattvas in the past have resided. “

source: །ཁ་ཆེའི་ཡུལ་ན་སྔོན་བྱང་ཆུབ་སེམས་དཔའ་བཞུགས་བཞུགས་པའི། གནས་ཤིན་ཏུ་སྟོན་པ་ཞེས་བྱ་བ་ཡོད་དོ།
en: In a land called Kashmir, there is a place called Sudarśaka, where bodhisattvas in the past have resided. “

source: །ཡུལ་དགའ་བ་འཕེལ་བ་ཞེས་བྱ་བ་ན། སྔོན་བྱང་ཆུབ་སེམས་དཔའ་བཞུགས་བཞུགས་པའི་གནས། གནས་བརྟན་གྱི་ཕུག་ཅེས་བྱ་བ་ཡོད་དོ།
en: In a land called Increasing Joy, there is a place called Sthavira Cave, where bodhisattvas in the past have resided. “

source: །ཡུལ་ཆུ་འཛིན་ཅེས་བྱ་བ་ན་སྔོན་བྱང་ཆུབ་སེམས་དཔའ་བཞུགས་བཞུགས་པའི། གནས་ཁྱོར་པོ་སྟོན་པ་ཞེས་བྱ་བ་ཡོད་དོ།
en: In a land called Jalandhar, there is a place called Teaching with Hands Folded, where bodhisattvas in the past have resided. “

source: །ཡུལ་ས་འཛིན་གྱི་དཀྱིལ་འཁོར་ན། སྔོན་བྱང་ཆུབ་སེམས་དཔའ་བཞུགས་བཞུགས་པའི་གནས། བརྒྱགས་ཀྱི་ཕུག་ཅེས་བྱ་བ་ཡོད་དོ། །ཤིན་ཏུ་རྒྱས་པ་ཆེན་པོའི་མདོ།
en: In the vicinity of the land called Gandhara, there is a place called Cave of Provisions, where bodhisattvas in the past have resided.”

source: །སངས་རྒྱས་ཕལ་པོ་ཆེ་ཞེས་བྱ་བ་ལས། བྱང་ཆུབ་སེམས་དཔའི་གནས་ཀྱི་ལེའུ་ཞེས་བྱ་བ་སྟེ། སུམ་ཅུ་བརྒྱད་པའོ།། །། །། །། །། །། །། །། །། །། །། །། །།
en: This concludes “The Dwellings of Bodhisattvas,” the thirty-eighth chapter of the extensive sūtra, “The Ornaments of the Buddhas.”
